## Terraform Summary

| Step                         | Result  |
|:-----------------------------|:-------:|
| 🖌  Terraform Format & Style | ✅ |
| ⚙️  Terraform Initialization  | ✅ |
| 🤖  Terraform Validation     | ✅ |
| 📖  Terraform Plan           | ✅ |

_**Hint:** If "Terraform Format & Style" failed, run `terraform fmt -recursive` from the `terraform/` directory and commit the results._

### Output

<details>
<summary>Validation Output</summary>

```
Success! The configuration is valid.


```

</details>

<details>
<summary>Plan Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
  ~ update in-place
-   destroy
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_ecs_service.console will be updated in-place
  ~ resource "aws_ecs_service" "console" {
        id                                 = "arn:aws:ecs:us-west-2:357150818708:service/cpfreporter/cpfreporter-console"
        name                               = "cpfreporter-console"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:us-west-2:357150818708:task-definition/cpfreporter-console:34" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.console must be replaced
+/- resource "aws_ecs_task_definition" "console" {
      ~ arn                      = "arn:aws:ecs:us-west-2:357150818708:task-definition/cpfreporter-console:34" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-west-2:357150818708:task-definition/cpfreporter-console" -> (known after apply)
      ~ container_definitions    = (sensitive value) # forces replacement
      ~ id                       = "cpfreporter-console" -> (known after apply)
      ~ revision                 = 34 -> (known after apply)
-       tags                     = {} -> null
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_s3_object.lambda_artifact-cpfValidation will be updated in-place
  ~ resource "aws_s3_object" "lambda_artifact-cpfValidation" {
      ~ etag                   = "eae6e9031bd39a0c2adceca7cf999cad-5" -> "04a1fc0c62a2d3a73d69887cbac0b8cb"
        id                     = "cpfValidation.04a1fc0c62a2d3a73d69887cbac0b8cb.zip"
        tags                   = {}
      ~ version_id             = "_.Ib442NVKi2bMCdPVCXxkKyLrdu.YMr" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.lambda_artifact-excelToJson will be updated in-place
  ~ resource "aws_s3_object" "lambda_artifact-excelToJson" {
      ~ etag                   = "41ce91252ab8d3546fb5905ff561b7c4-6" -> "20739793d622992f3eae2ba77a6afbb0"
        id                     = "excelToJson.20739793d622992f3eae2ba77a6afbb0.zip"
        tags                   = {}
      ~ version_id             = "Twrycptx0gOcvxvvvAkTm1VRzK0O50A4" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.lambda_artifact-graphql will be updated in-place
  ~ resource "aws_s3_object" "lambda_artifact-graphql" {
      ~ etag                   = "4d9b7d28d657997f080fe7e419364fa7-6" -> "8b5829391343440b34a2fc994a862af7"
        id                     = "graphql.8b5829391343440b34a2fc994a862af7.zip"
        tags                   = {}
      ~ version_id             = "qtDwyg3k61VCa0cbt8dY74Tm9r_TyfVk" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["200.html"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "7e472449a93ffde57e7e29c87280c4d4" -> "f3ea65731d99ea397c8515120dc96ce6"
        id                     = "dist/200.html"
      ~ source_hash            = "7e472449a93ffde57e7e29c87280c4d4" -> "f3ea65731d99ea397c8515120dc96ce6"
        tags                   = {}
      ~ version_id             = "CYioCSBcAo.Zf20nadvfd.17ZGmA6aGw" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["build-manifest.json"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "941d56c10953cfcce508725b59515768" -> "7e4cd6cd8360f830d3baad0b6bcc9d9c"
        id                     = "dist/build-manifest.json"
      ~ source_hash            = "941d56c10953cfcce508725b59515768" -> "7e4cd6cd8360f830d3baad0b6bcc9d9c"
        tags                   = {}
      ~ version_id             = "xLT0mC84SoStGEl4iJUD_FDPdzzrK_TY" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["chunk-references.json"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "816f57b13ddeeba6dd0a1784bf333db0" -> "56dd429963e0b58d15b4e560f0d49530"
        id                     = "dist/chunk-references.json"
      ~ source_hash            = "816f57b13ddeeba6dd0a1784bf333db0" -> "56dd429963e0b58d15b4e560f0d49530"
        tags                   = {}
      ~ version_id             = "IaaF8wVK3Ll3JxnPRLzN1LkECz7UES9b" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["index.html"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "7e472449a93ffde57e7e29c87280c4d4" -> "f3ea65731d99ea397c8515120dc96ce6"
        id                     = "dist/index.html"
      ~ source_hash            = "7e472449a93ffde57e7e29c87280c4d4" -> "f3ea65731d99ea397c8515120dc96ce6"
        tags                   = {}
      ~ version_id             = "92_5_lTLEDlxD4fYzogV6YX2AmUXt3hY" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.8e89a4a9.js"] will be destroyed
  # (because key ["static/js/app.8e89a4a9.js"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/javascript" -> null
-       etag                   = "afb287e593a9800c25675855f476d8b7" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/app.8e89a4a9.js" -> null
-       key                    = "dist/static/js/app.8e89a4a9.js" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.8e89a4a9.js" -> null
-       source_hash            = "afb287e593a9800c25675855f476d8b7" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "Nz_SeRhOV2fVLASREO5ZdJ2Y9GmS3sMr" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.8e89a4a9.js.LICENSE.txt"] will be destroyed
  # (because key ["static/js/app.8e89a4a9.js.LICENSE.txt"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/plain" -> null
-       etag                   = "9ca7566c06c8f1334eac82d09ba421ad" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/app.8e89a4a9.js.LICENSE.txt" -> null
-       key                    = "dist/static/js/app.8e89a4a9.js.LICENSE.txt" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.8e89a4a9.js.LICENSE.txt" -> null
-       source_hash            = "9ca7566c06c8f1334eac82d09ba421ad" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "nWJN2BEOkjjQY5VLp2AKQzuxvZB_IALu" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.d8a0b32e.js"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/javascript"
+       etag                   = "5e658d63f30b1640719f3c62e2df8687"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/app.d8a0b32e.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.d8a0b32e.js"
+       source_hash            = "5e658d63f30b1640719f3c62e2df8687"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.d8a0b32e.js.LICENSE.txt"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/plain"
+       etag                   = "9ca7566c06c8f1334eac82d09ba421ad"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/app.d8a0b32e.js.LICENSE.txt"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.d8a0b32e.js.LICENSE.txt"
+       source_hash            = "9ca7566c06c8f1334eac82d09ba421ad"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # module.api_gateway.aws_apigatewayv2_api.this[0] will be updated in-place
  ~ resource "aws_apigatewayv2_api" "this" {
        id                           = "kxob8wkmkf"
        name                         = "cpfreporter"
        tags                         = {}
        # (9 unchanged attributes hidden)

      ~ cors_configuration {
          ~ allow_headers     = [
-               "auth-provider",
                # (11 unchanged elements hidden)
            ]
            # (5 unchanged attributes hidden)
        }
    }

  # module.lambda_function-cpfValidation.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cpfreporter-cpfValidation"
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-cpfValidation:3" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-cpfValidation:3/invocations" -> (known after apply)
        tags                           = {}
      ~ version                        = "3" -> (known after apply)
        # (21 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_COMMIT_SHA"                = "591c61907fd55bbb658acf43ff4d44d2a72337da" -> "68cba347acd3d6cc462c10c2d65d8b217ad8b2ed"
              ~ "DD_TAGS"                      = "git.commit.sha:591c61907fd55bbb658acf43ff4d44d2a72337da,git.repository_url:github.com/usdigitalresponse/cpf-reporter" -> "git.commit.sha:68cba347acd3d6cc462c10c2d65d8b217ad8b2ed,git.repository_url:github.com/usdigitalresponse/cpf-reporter"
              ~ "DD_VERSION"                   = "591c61907fd55bbb658acf43ff4d44d2a72337da" -> "68cba347acd3d6cc462c10c2d65d8b217ad8b2ed"
                # (13 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.lambda_function-cpfValidation.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "3" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_function-excelToJson.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cpfreporter-excelToJson"
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-excelToJson:3" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-excelToJson:3/invocations" -> (known after apply)
        tags                           = {}
      ~ version                        = "3" -> (known after apply)
        # (21 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_COMMIT_SHA"                = "591c61907fd55bbb658acf43ff4d44d2a72337da" -> "68cba347acd3d6cc462c10c2d65d8b217ad8b2ed"
              ~ "DD_TAGS"                      = "git.commit.sha:591c61907fd55bbb658acf43ff4d44d2a72337da,git.repository_url:github.com/usdigitalresponse/cpf-reporter" -> "git.commit.sha:68cba347acd3d6cc462c10c2d65d8b217ad8b2ed,git.repository_url:github.com/usdigitalresponse/cpf-reporter"
              ~ "DD_VERSION"                   = "591c61907fd55bbb658acf43ff4d44d2a72337da" -> "68cba347acd3d6cc462c10c2d65d8b217ad8b2ed"
                # (13 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.lambda_function-excelToJson.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "3" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_function-graphql.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cpfreporter-graphql"
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-graphql:50" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-graphql:50/invocations" -> (known after apply)
        tags                           = {}
      ~ version                        = "50" -> (known after apply)
        # (21 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_COMMIT_SHA"                      = "591c61907fd55bbb658acf43ff4d44d2a72337da" -> "68cba347acd3d6cc462c10c2d65d8b217ad8b2ed"
              ~ "DD_TAGS"                            = "git.commit.sha:591c61907fd55bbb658acf43ff4d44d2a72337da,git.repository_url:github.com/usdigitalresponse/cpf-reporter" -> "git.commit.sha:68cba347acd3d6cc462c10c2d65d8b217ad8b2ed,git.repository_url:github.com/usdigitalresponse/cpf-reporter"
              ~ "DD_VERSION"                         = "591c61907fd55bbb658acf43ff4d44d2a72337da" -> "68cba347acd3d6cc462c10c2d65d8b217ad8b2ed"
                # (17 unchanged elements hidden)
            }
        }

        # (4 unchanged blocks hidden)
    }

  # module.lambda_function-graphql.aws_lambda_permission.current_version_triggers["APIGateway"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "APIGateway" -> (known after apply)
      ~ qualifier           = "50" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

Plan: 6 to add, 12 to change, 6 to destroy.
```

</details>

*Pusher: @as1729, Action: `pull_request_target`, Workflow: [`Continuous Integration`](https://github.com/usdigitalresponse/cpf-reporter/actions/runs/7493773243)*